# Module: Pandas Assignments
## Lesson: Pandas
### Assignment 1: DataFrame Creation and Indexing

1. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Set the index to be the first column.
2. Create a Pandas DataFrame with columns 'A', 'B', 'C' and index 'X', 'Y', 'Z'. Fill the DataFrame with random integers and access the element at row 'Y' and column 'B'.

### Assignment 2: DataFrame Operations

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Add a new column that is the product of the first two columns.
2. Create a Pandas DataFrame with 3 columns and 4 rows filled with random integers. Compute the row-wise and column-wise sum.

### Assignment 3: Data Cleaning

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Introduce some NaN values. Fill the NaN values with the mean of the respective columns.
2. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Introduce some NaN values. Drop the rows with any NaN values.

### Assignment 4: Data Aggregation

1. Create a Pandas DataFrame with 2 columns: 'Category' and 'Value'. Fill the 'Category' column with random categories ('A', 'B', 'C') and the 'Value' column with random integers. Group the DataFrame by 'Category' and compute the sum and mean of 'Value' for each category.
2. Create a Pandas DataFrame with 3 columns: 'Product', 'Category', and 'Sales'. Fill the DataFrame with random data. Group the DataFrame by 'Category' and compute the total sales for each category.

### Assignment 5: Merging DataFrames

1. Create two Pandas DataFrames with a common column. Merge the DataFrames using the common column.
2. Create two Pandas DataFrames with different columns. Concatenate the DataFrames along the rows and along the columns.

### Assignment 6: Time Series Analysis

1. Create a Pandas DataFrame with a datetime index and one column filled with random integers. Resample the DataFrame to compute the monthly mean of the values.
2. Create a Pandas DataFrame with a datetime index ranging from '2021-01-01' to '2021-12-31' and one column filled with random integers. Compute the rolling mean with a window of 7 days.

### Assignment 7: MultiIndex DataFrame

1. Create a Pandas DataFrame with a MultiIndex (hierarchical index). Perform some basic indexing and slicing operations on the MultiIndex DataFrame.
2. Create a Pandas DataFrame with MultiIndex consisting of 'Category' and 'SubCategory'. Fill the DataFrame with random data and compute the sum of values for each 'Category' and 'SubCategory'.

### Assignment 8: Pivot Tables

1. Create a Pandas DataFrame with columns 'Date', 'Category', and 'Value'. Create a pivot table to compute the sum of 'Value' for each 'Category' by 'Date'.
2. Create a Pandas DataFrame with columns 'Year', 'Quarter', and 'Revenue'. Create a pivot table to compute the mean 'Revenue' for each 'Quarter' by 'Year'.

### Assignment 9: Applying Functions

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Apply a function that doubles the values of the DataFrame.
2. Create a Pandas DataFrame with 3 columns and 6 rows filled with random integers. Apply a lambda function to create a new column that is the sum of the existing columns.

### Assignment 10: Working with Text Data

1. Create a Pandas Series with 5 random text strings. Convert all the strings to uppercase.
2. Create a Pandas Series with 5 random text strings. Extract the first three characters of each string.

----------------------------------------------------------------------------------------------------

In [2]:
import pandas as pd
import numpy as np

#### Assignment 1: DataFrame Creation and Indexing
1. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Set the index to be the first column.
2. Create a Pandas DataFrame with columns 'A', 'B', 'C' and index 'X', 'Y', 'Z'. Fill the DataFrame with random integers and access the element at row 'Y' and column 'B'.

In [3]:
#Task 1
df = pd.DataFrame(
    np.random.randint(1, 100, size = (6, 4)),
    columns = ['A', 'B', 'C', 'D']
)
print("Original DataFrame:")
display(df)

df.set_index('A', inplace=True)
print("DataFrame with new index:")
display(df)

Original DataFrame:

    A   B   C   D
0  20  52  82  27
1  66  99  59   4
2  49   7   2  68
3  58  55  46   3
4  39  69  62  33
5  21  93  41  98

DataFrame with new index:

     B   C   D
A
20  52  82  27
66  99  59   4
49   7   2  68
58  55  46   3
39  69  62  33
21  93  41  98

In [4]:
#Task 2
df = pd.DataFrame(
    np.random.randint(1, 100, size = (3, 3)),
    columns = ['A', 'B', 'C'],
    index = ['X', 'Y', 'Z']
)
print("Original DataFrame:")
display(df)

print(f"Element at row Y and column B: {df.at['Y', 'B']}")

Original DataFrame:

    A   B   C
X  14  77  60
Y  86  30   2
Z  21  94  80

Element at row Y and column B: 30

#### Assignment 2: DataFrame Operations
1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Add a new column that is the product of the first two columns.
2. Create a Pandas DataFrame with 3 columns and 4 rows filled with random integers. Compute the row-wise and column-wise sum.

In [6]:
#Task 1
df = pd.DataFrame(
    np.random.randint(1, 100, size = (5, 3)),
    columns = ['A', 'B', 'C']
)
print("Original DataFrame:")
display(df)

df['D'] = df['A'] * df['B']
print("DataFrame with new column:")
display(df)

Original DataFrame:

    A   B   C
0  16  94  30
1  63  98  71
2  86   9  24
3  27  69  87
4  79  60   8

DataFrame with new column:

    A   B   C     D
0  16  94  30  1504
1  63  98  71  6174
2  86   9  24   774
3  27  69  87  1863
4  79  60   8  4740

In [13]:
#Task 2
df = pd.DataFrame(
    np.random.randint(1, 10, size = (4, 3)),
    columns = ['A', 'B', 'C'],
    index = ['Row1', 'Row2', 'Row3', 'Row4']
)
print("Original DataFrame:")
display(df)

row_sum = df.sum(axis = 1)
col_sum = df.sum(axis = 0)

print("Row-wise sum:")
display(row_sum)
print("Column-wise sum:")
display(col_sum)

Original DataFrame:

      A  B  C
Row1  1  4  9
Row2  3  1  2
Row3  2  8  9
Row4  3  7  1

Row-wise sum:

Row1    14
Row2     6
Row3    19
Row4    11
dtype: int64

Column-wise sum:

A     9
B    20
C    21
dtype: int64

#### Assignment 3: Data Cleaning

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Introduce some NaN values. Fill the NaN values with the mean of the respective columns.
2. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Introduce some NaN values. Drop the rows with any NaN values.

In [12]:
#Task 1
df = pd.DataFrame(np.random.randint(1, 100, size=(5, 3)), columns=['A', 'B', 'C'])
print("Original DataFrame:")
display(df)

df.iloc[0, 1] = np.nan
df.iloc[2, 2] = np.nan
df.iloc[4, 0] = np.nan
print("DataFrame with NaN values:")
display(df)

df.fillna(df.mean(), inplace=True)
print("DataFrame with NaN values filled:")
display(df)

Original DataFrame:

    A   B   C
0  85  74   6
1  93  25  97
2  77  37  82
3  48  14  54
4  87  65   1

DataFrame with NaN values:

      A     B     C
0  85.0   NaN   6.0
1  93.0  25.0  97.0
2  77.0  37.0   NaN
3  48.0  14.0  54.0
4   NaN  65.0   1.0

DataFrame with NaN values filled:

       A      B     C
0  85.00  35.25   6.0
1  93.00  25.00  97.0
2  77.00  37.00  39.5
3  48.00  14.00  54.0
4  75.75  65.00   1.0

In [17]:
#Task 2
df = pd.DataFrame(
    np.random.randint(1, 100, size=(6, 4)), 
    columns=['A', 'B', 'C', 'D'],
    index=['Row1', 'Row2', 'Row3', 'Row4', 'Row5', 'Row6']
)
print("Original DataFrame:")
display(df)

df.iloc[0, 1] = np.nan
df.iloc[2, 2] = np.nan
df.iloc[4, 0] = np.nan
print("DataFrame with NaN values:")
display(df)

df.dropna(inplace=True)
print("DataFrame with NaN values Dropped:")
display(df)

Original DataFrame:

       A   B   C   D
Row1  84  74  19  49
Row2  72  14  68  59
Row3  96   6  63  38
Row4   5  88  85  96
Row5  41  91  35  58
Row6  13  36  54  16

DataFrame with NaN values:

         A     B     C   D
Row1  84.0   NaN  19.0  49
Row2  72.0  14.0  68.0  59
Row3  96.0   6.0   NaN  38
Row4   5.0  88.0  85.0  96
Row5   NaN  91.0  35.0  58
Row6  13.0  36.0  54.0  16

DataFrame with NaN values Dropped:

         A     B     C   D
Row2  72.0  14.0  68.0  59
Row4   5.0  88.0  85.0  96
Row6  13.0  36.0  54.0  16